if GetLocale() ~= "zhCN" then
    return
end

-- - @type l10n
local l10n = QuestieLoader:ImportModule("l10n")

l10n.factionGroupLookup = {
    -- UNKNOWN
    [-1] = {
        [59] = "瑟银兄弟会",
        [70] = "辛迪加",
        [87] = "血帆海盗",
        [92] = "吉尔吉斯半人马",
        [93] = "玛格拉姆半人马",
        [270] = "赞达拉部族",
        [349] = "拉文霍德",
        [471] = "蛮锤部族",
        [529] = "银色黎明",
        [576] = "木喉要塞",
        [589] = "冬刃豹训练师",
        [609] = "塞纳里奥议会",
        [749] = "海达希亚水元素",
        [809] = "辛德拉",
        [909] = "暗月马戏团",
        [910] = "诺兹多姆的子嗣",
    },
    -- 部落
    [67] = {
        [68] = "幽暗城",
        [76] = "奥格瑞玛",
        [81] = "雷霆崖",
        [530] = "暗矛巨魔",
    },
    -- 热砂港
    [169] = {
        [21] = "藏宝海湾",
        [369] = "加基森",
        [470] = "棘齿城",
        [577] = "永望镇",
    },
    -- 联盟
    [469] = {
        [47] = "铁炉堡",
        [54] = "诺莫瑞根流亡者",
        [69] = "达纳苏斯",
        [72] = "暴风城",
    },
    -- 联盟部队
    [891] = {
        [509] = "阿拉索联军",
        [730] = "雷矛卫队",
        [890] = "银翼要塞",
    },
    -- 部落军队
    [892] = {
        [510] = "污染者",
        [729] = "霜狼氏族",
        [889] = "战歌氏族",
    },
}
