if GetLocale() ~= "ruRU" then
    return
end

-- - @type l10n
local l10n = QuestieLoader:ImportModule("l10n")

l10n.factionGroupLookup = {
    -- UNKNOWN
    [-1] = {
        [59] = "Братство Тория",
        [70] = "Синдикат",
        [87] = "Пираты Кровавого Паруса",
        [92] = "Кентавры из племени Гелкис",
        [93] = "Кентавры племени Маграм",
        [270] = "Племя Зандалар",
        [349] = "Черный Ворон",
        [471] = "Клан Громового Молота",
        [529] = "Серебряный Рассвет",
        [576] = "Крепость Древобрюхов",
        [589] = "Дрессировщики ледопардов",
        [609] = "Круг Кенария",
        [749] = "Гидраксианские Повелители Вод",
        [809] = "Шен'дралары",
        [909] = "Ярмарка Новолуния",
        [910] = "Потомок Ноздорму",
        [922] = "Транквиллион",
        [967] = "Аметистовое Око",
        [989] = "Хранители Времени",
        [990] = "Песчаная Чешуя",
    },
    -- Орда
    [67] = {
        [68] = "Подгород",
        [76] = "Оргриммар",
        [81] = "Громовой Утес",
        [530] = "Племя Черного Копья",
        [911] = "Луносвет",
    },
    -- Картель Хитрая Шестеренка
    [169] = {
        [21] = "Пиратская Бухта",
        [369] = "Прибамбасск",
        [470] = "Кабестан",
        [577] = "Круговзор",
    },
    -- Альянс
    [469] = {
        [47] = "Стальгорн",
        [54] = "Изгнанники Гномрегана",
        [69] = "Дарнасс",
        [72] = "Штормград",
        [930] = "Экзодар",
    },
    -- Силы Альянса
    [891] = {
        [509] = "Лига Аратора",
        [730] = "Стража Грозовой Вершины",
        [890] = "Среброкрылые Часовые",
    },
    -- Силы Орды
    [892] = {
        [510] = "Осквернители",
        [729] = "Клан Северного Волка",
        [889] = "Всадники из клана Песни Войны",
    },
    -- Шаттрат
    [936] = {
        [932] = "Алдоры",
        [934] = "Провидцы",
        [935] = "Ша'тар",
        [1011] = "Нижний город",
        [1031] = "Стражи небес Ша'тар",
        [1077] = "Армия Расколотого Солнца",
    },
    -- Запределье
    [980] = {
        [933] = "Консорциум",
        [941] = "Маг'хары",
        [942] = "Кенарийская экспедиция",
        [946] = "Оплот Чести",
        [947] = "Траллмар",
        [970] = "Спореггар",
        [978] = "Куренай",
        [1012] = "Пеплоусты-служители",
        [1015] = "Крылья Пустоты",
        [1038] = "Огри'ла",
    },
}
