if GetLocale() ~= "zhCN" then
    return
end

-- - @type l10n
local l10n = QuestieLoader:ImportModule("l10n")

l10n.factionGroupLookup = {
    -- UNKNOWN
    [-1] = {
        [70] = "辛迪加",
        [471] = "蛮锤部族",
        [589] = "冬刃豹训练师",
    },
    -- 部落
    [67] = {
        [68] = "幽暗城",
        [76] = "奥格瑞玛",
        [81] = "雷霆崖",
        [530] = "暗矛巨魔",
        [911] = "银月城",
    },
    -- 热砂港
    [169] = {
        [21] = "藏宝海湾",
        [369] = "加基森",
        [470] = "棘齿城",
        [577] = "永望镇",
    },
    -- 联盟
    [469] = {
        [47] = "铁炉堡",
        [54] = "诺莫瑞根流亡者",
        [69] = "达纳苏斯",
        [72] = "暴风城",
        [930] = "埃索达",
    },
    -- 联盟部队
    [891] = {
        [509] = "阿拉索联军",
        [730] = "雷矛卫队",
        [890] = "银翼要塞",
    },
    -- 部落军队
    [892] = {
        [510] = "污染者",
        [729] = "霜狼氏族",
        [889] = "战歌氏族",
    },
    -- 沙塔斯城
    [936] = {
        [932] = "奥尔多",
        [934] = "占星者",
        [935] = "沙塔尔",
        [1011] = "贫民窟",
        [1031] = "沙塔尔天空卫队",
        [1077] = "破碎残阳",
    },
    -- 燃烧的远征
    [980] = {
        [933] = "星界财团",
        [941] = "玛格汉",
        [942] = "塞纳里奥远征队",
        [946] = "荣耀堡",
        [947] = "萨尔玛",
        [967] = "紫罗兰之眼",
        [970] = "孢子村",
        [978] = "库雷尼",
        [989] = "时光守护者",
        [990] = "流沙之鳞",
        [1012] = "灰舌死誓者",
        [1015] = "灵翼之龙",
        [1038] = "奥格瑞拉",
    },
    -- 联盟先遣军
    [1037] = {
        [1050] = "无畏远征军",
        [1068] = "探险者协会",
        [1094] = "银色盟约",
        [1126] = "霜脉矮人",
    },
    -- 部落先遣军
    [1052] = {
        [1064] = "牦牛人",
        [1067] = "复仇之手",
        [1085] = "战歌远征军",
        [1124] = "夺日者",
    },
    -- 巫妖王之怒
    [1097] = {
        [1037] = "联盟先遣军",
        [1052] = "部落先遣军",
        [1073] = "卡鲁亚克",
        [1090] = "肯瑞托",
        [1091] = "龙眠联军",
        [1098] = "黑锋骑士团",
        [1106] = "银色北伐军",
        [1119] = "霍迪尔之子",
        [1156] = "灰烬审判军",
    },
    -- 索拉查盆地
    [1117] = {
        [1104] = "狂心氏族",
        [1105] = "神谕者",
    },
    -- 经典旧世
    [1118] = {
        [59] = "瑟银兄弟会",
        [87] = "血帆海盗",
        [92] = "吉尔吉斯半人马",
        [93] = "玛格拉姆半人马",
        [270] = "赞达拉部族",
        [349] = "拉文霍德",
        [529] = "银色黎明",
        [576] = "木喉要塞",
        [609] = "塞纳里奥议会",
        [749] = "海达希亚水元素",
        [809] = "辛德拉",
        [909] = "暗月马戏团",
        [910] = "诺兹多姆的子嗣",
        [922] = "塔奎林",
    },
}
